In [1]:
# Step 0: Import Libraries 

import pandas as pd
import numpy as np

In [2]:
# Create Messy Data

data = {
    'Transaction_ID': [101, 102, 102, 103, 104, 105, 106, 107, 108, 109],
    'Date': ['2025-01-01', '2025/01/02', '2025/01/02', '03-01-2025', '2025-01-04', np.nan, '2025-01-06', '2025-01-07', '2025-01-08', '2025-01-09'],
    'Customer_Name': [' John Doe', 'Jane Smith', 'Jane Smith', 'bob brown', 'ALICE WHITE', 'John Doe', 'Charlie Green', '  Dave Blue', 'Eve Black', np.nan],
    'Product': ['Laptop', 'Mouse', 'Mouse', 'Keyboard', 'Monitor', 'Laptop', 'Tablet', 'Headphones', 'Laptop', 'Mouse'],
    'Price': ['$1200', '25', '25', 'no_price', '300', '1200', '450', '80', '1200', '25'],
    'Quantity': [1, 2, 2, 1, 1, 1, 3, 2, np.nan, 1]
}


df = pd.DataFrame(data)
df

   Transaction_ID        Date  Customer_Name     Product     Price  Quantity
0             101  2025-01-01       John Doe      Laptop     $1200       1.0
1             102  2025/01/02     Jane Smith       Mouse        25       2.0
2             102  2025/01/02     Jane Smith       Mouse        25       2.0
3             103  03-01-2025      bob brown    Keyboard  no_price       1.0
4             104  2025-01-04    ALICE WHITE     Monitor       300       1.0
5             105         NaN       John Doe      Laptop      1200       1.0
6             106  2025-01-06  Charlie Green      Tablet       450       3.0
7             107  2025-01-07      Dave Blue  Headphones        80       2.0
8             108  2025-01-08      Eve Black      Laptop      1200       NaN
9             109  2025-01-09            NaN       Mouse        25       1.0

In [3]:
# Step 1: Handle Duplicates & Missing Values

df = df.drop_duplicates().dropna(subset=['Date']).copy()
df

   Transaction_ID        Date  Customer_Name     Product     Price  Quantity
0             101  2025-01-01       John Doe      Laptop     $1200       1.0
1             102  2025/01/02     Jane Smith       Mouse        25       2.0
3             103  03-01-2025      bob brown    Keyboard  no_price       1.0
4             104  2025-01-04    ALICE WHITE     Monitor       300       1.0
6             106  2025-01-06  Charlie Green      Tablet       450       3.0
7             107  2025-01-07      Dave Blue  Headphones        80       2.0
8             108  2025-01-08      Eve Black      Laptop      1200       NaN
9             109  2025-01-09            NaN       Mouse        25       1.0

In [4]:
# Step 2: Standardize Text

df['Customer_Name'] = df['Customer_Name'].str.strip().str.title()

# Handle the remaining NaN in Customer Name

df['Customer_Name'] = df['Customer_Name'].fillna('Unknown')
df

   Transaction_ID        Date  Customer_Name     Product     Price  Quantity
0             101  2025-01-01       John Doe      Laptop     $1200       1.0
1             102  2025/01/02     Jane Smith       Mouse        25       2.0
3             103  03-01-2025      Bob Brown    Keyboard  no_price       1.0
4             104  2025-01-04    Alice White     Monitor       300       1.0
6             106  2025-01-06  Charlie Green      Tablet       450       3.0
7             107  2025-01-07      Dave Blue  Headphones        80       2.0
8             108  2025-01-08      Eve Black      Laptop      1200       NaN
9             109  2025-01-09        Unknown       Mouse        25       1.0

In [5]:
# Step 3: Clean & Convert Numeric Data (Price)
# Remove '$' and convert to float;

df['Price'] = df['Price'].str.replace('$', '', regex=False)
df['Price'] = pd.to_numeric(df['Price'], errors='coerce')
df

   Transaction_ID        Date  Customer_Name     Product   Price  Quantity
0             101  2025-01-01       John Doe      Laptop  1200.0       1.0
1             102  2025/01/02     Jane Smith       Mouse    25.0       2.0
3             103  03-01-2025      Bob Brown    Keyboard     NaN       1.0
4             104  2025-01-04    Alice White     Monitor   300.0       1.0
6             106  2025-01-06  Charlie Green      Tablet   450.0       3.0
7             107  2025-01-07      Dave Blue  Headphones    80.0       2.0
8             108  2025-01-08      Eve Black      Laptop  1200.0       NaN
9             109  2025-01-09        Unknown       Mouse    25.0       1.0

In [6]:
# Step 4: Impute Missing Values (Quantity & Price)

df['Quantity'] = df['Quantity'].fillna(1)
df['Price'] = df['Price'].fillna(df['Price'].median())
df

   Transaction_ID        Date  Customer_Name     Product   Price  Quantity
0             101  2025-01-01       John Doe      Laptop  1200.0       1.0
1             102  2025/01/02     Jane Smith       Mouse    25.0       2.0
3             103  03-01-2025      Bob Brown    Keyboard   300.0       1.0
4             104  2025-01-04    Alice White     Monitor   300.0       1.0
6             106  2025-01-06  Charlie Green      Tablet   450.0       3.0
7             107  2025-01-07      Dave Blue  Headphones    80.0       2.0
8             108  2025-01-08      Eve Black      Laptop  1200.0       1.0
9             109  2025-01-09        Unknown       Mouse    25.0       1.0

In [8]:
# Step 5: Standardize Dates

df['Date'] = pd.to_datetime(df['Date'], format='mixed', dayfirst=False)
df

   Transaction_ID       Date  Customer_Name     Product   Price  Quantity
0             101 2025-01-01       John Doe      Laptop  1200.0       1.0
1             102 2025-01-02     Jane Smith       Mouse    25.0       2.0
3             103 2025-03-01      Bob Brown    Keyboard   300.0       1.0
4             104 2025-01-04    Alice White     Monitor   300.0       1.0
6             106 2025-01-06  Charlie Green      Tablet   450.0       3.0
7             107 2025-01-07      Dave Blue  Headphones    80.0       2.0
8             108 2025-01-08      Eve Black      Laptop  1200.0       1.0
9             109 2025-01-09        Unknown       Mouse    25.0       1.0

In [9]:
# Step 6: Final Type Costing

df['Quantity'] = df['Quantity'].astype(int)
df

   Transaction_ID       Date  Customer_Name     Product   Price  Quantity
0             101 2025-01-01       John Doe      Laptop  1200.0         1
1             102 2025-01-02     Jane Smith       Mouse    25.0         2
3             103 2025-03-01      Bob Brown    Keyboard   300.0         1
4             104 2025-01-04    Alice White     Monitor   300.0         1
6             106 2025-01-06  Charlie Green      Tablet   450.0         3
7             107 2025-01-07      Dave Blue  Headphones    80.0         2
8             108 2025-01-08      Eve Black      Laptop  1200.0         1
9             109 2025-01-09        Unknown       Mouse    25.0         1

In [10]:
# Check data types

df.dtypes

Transaction_ID             int64
Date              datetime64[ns]
Customer_Name             object
Product                   object
Price                    float64
Quantity                   int32
dtype: object